{
  "description": "Slides and more info: http://www.elixirconf.eu/elixirconf2016/bram-verburg\n\nEvery new language or framework needs time to prove itself in production, for its early adopter to try, fail, iterate, and document what they have learned. Elixir and Phoenix can leverage the 30 years head-start of the underlying Erlang platform, but for newcomers to the platform it is not always easy to find and apply Erlang best practices. This talk explores some specific security-related aspects of Elixir, Phoenix and the Erlang VM, through practical demonstrations and use-cases. Topics covered include: use of Erlang's 'ssl' module, distributed Erlang, and VM hardening against DoS attacks.\n\nTalk objectives\n\nThe purpose of this talk is to make people familiar with some of the Erlang/Elixir specific security considerations. It is focussed on those things that may surprise people coming to Elixir from other languages, and therefore skims over common attack patterns (XSS, CSRF, SQLI, etc.) and their mitigations.\n\nTarget audience\n\nAnyone planning to deploy an Elixir application, with or without experience in deployment/security using other languages/platforms.\n\n\nBram is a system architect and security advocate at Cisco Systems. His work focusses on massively concurrent back-end systems for IoT/IoE applications, preferably built using Erlang/Elixir, as well as PKI-based security solutions for such environments. He has previously built/designed API servers using Ruby on Rails, as well as VoIP soft switches in Java.",
  "id": "ec47ff09-18d2-42e1-b0ea-a2d1dbbd5f15",
  "meta": { "duration": "PT42M53S" },
  "presenter": { "name": null },
  "slug": "bram-verburg-securing-elixir-applications-elixirconfeu-2016",
  "source": { "id": "r0DuAse9tK8", "provider": "youtube" },
  "tag": ["Bram Verburg", "Elixir", "ElixirConfEU", "Phoenix"],
  "title": "Bram Verburg - Securing Elixir Applications (ElixirConfEU 2016)",
  "thumbnails": {
    "default": {
      "url": "https://i.ytimg.com/vi/r0DuAse9tK8/default.jpg",
      "width": 120,
      "height": 90
    },
    "medium": {
      "url": "https://i.ytimg.com/vi/r0DuAse9tK8/mqdefault.jpg",
      "width": 320,
      "height": 180
    },
    "high": {
      "url": "https://i.ytimg.com/vi/r0DuAse9tK8/hqdefault.jpg",
      "width": 480,
      "height": 360
    }
  }
}
