{"data":{"talkJson":{"description":"Steve Jobs, one of the computer industry’s foremost entrepreneurs, gives a wide-ranging talk to a group of MIT Sloan School of Management students in the spring of 1992. Jobs shares his professional vision and personal anecdotes, from his role at the time as president and CEO of NeXT Computer Corporation, to the thrilling challenges of co-creating Apple Computer, and subsequent disappointments at his ousting. In conversational exchanges with audience members Jobs underscores the value of direct experience in the field, and “developing scar tissue.” The unexpected guest lecture within the Sloan Distinguished Speaker Series came about through the efforts of a Sloan MBA ’92 student whose sister had recently married Jobs.","meta":{"duration":"PT1H12M54S"},"presenter":{"name":null},"slug":"steve-jobs-professional-vision-and-personal-anecdotes","source":{"id":"Gk-9Fd2mEnI","provider":"youtube"},"tag":["MIT","steve jobs","next computer","apple","bill gates"],"title":"Steve Jobs professional vision and personal anecdotes"},"allTalkJson":{"edges":[{"node":{"description":"Barbara Liskov, Professor of Electrical Engineering and Computer Science\nat the Massachusetts Institute of Technology, discusses \"Programming the Turing Machine\" in a lecture given on the occasion of Princeton University's centennial celebration of Alan Turing. Learn more at www.princeton.edu/turing\n\n#turingprinceton","meta":{"duration":"PT1H6M10S"},"presenter":{"name":null},"source":{"id":"ibRar7sWulM","provider":"youtube"},"slug":"barbara-liskov-programming-the-turing-machine","tag":["Barbara Liskov","MIT","Turing machine","Princeton","Turing centennial","Alan Turing","#turingprinceton"],"thumbnails":{"default":{"url":"https://i.ytimg.com/vi/ibRar7sWulM/default.jpg","height":90,"width":120}},"title":"Barbara Liskov: Programming the Turing Machine"}},{"node":{"description":"Richard Stallman in Zurich: The father of the movement for free software about his rebellion against administrative slack at MIT, about \"foolish\" Apple aficionados, current fights against evil software companies and Swiss national hero William Tell, who could serve as a role model in the fight against an unjust copyright.\n\nBy the way: After the camera was turned off, Richard and I talked about some other topics: Ads in the web and his Free Software song. This part is available as audio recording here, just skip to minute 20:37: http://www.stadtfilter.ch/DigitalPodcast/Digital20160517","meta":{"duration":"PT55M31S"},"presenter":{"name":"Richard Stallman"},"source":{"id":"fkkDvKGcNSo","provider":"youtube"},"slug":"apple-fanboys-are-foolish-people","tag":["Free Software foundation","Interview","MIT","Open Source"],"thumbnails":{"default":{"url":"https://i.ytimg.com/vi/fkkDvKGcNSo/default.jpg","height":90,"width":120}},"title":"Apple fanboys are foolish people"}}]}},"pageContext":{"slug":"steve-jobs-professional-vision-and-personal-anecdotes","tags":["MIT","steve jobs","next computer","apple","bill gates"]}}