{"data":{"allTalkJson":{"edges":[{"node":{"description":"Towards the end of last year I attended a workshop with my colleagues in ThoughtWorks to discuss the nature of “event-driven” applications. Over the last few years we've been building lots of systems that make a lot of use of events, and they've been often praised, and often damned. Our North American office organized a summit, and ThoughtWorks senior developers from all over the world showed up to share ideas.\nThe biggest outcome of the summit was recognizing that when people talk about “events”, they actually mean some quite different things. So we spent a lot of time trying to tease out what some useful patterns might be. This note is a brief summary of the main ones we identified.","meta":{"duration":"PT50M6S"},"presenter":{"name":"Martin Fowler"},"source":{"id":"STKCRSUsyP0","provider":"youtube"},"slug":"the-many-meanings-of-event-driven-architecture","tag":["GOTO Conference","Chicago","Keynote"],"thumbnails":{"default":{"url":"https://i.ytimg.com/vi/STKCRSUsyP0/default.jpg","height":90,"width":120}},"title":"The Many Meanings of Event-Driven Architecture"}},{"node":{"description":"For an industry steeped in a mythos of innovation and invention, the path towards reliable software is often obstructed by a web of fixed ideas. Fixed ideas, by actively obscuring alternatives, lead us to inaccurately the weigh the risks and benefits associated with our choices whether they be of an engineering, managerial or business nature. Alan Kay famously quipped that a difference in perspective is worth 80 IQ points but in this talk we'll see that it's worth considerably more than that.","meta":{"duration":"PT39M37S"},"presenter":{"name":"David Nolen"},"source":{"id":"lzXHMy4ewtM","provider":"youtube"},"slug":"idee-fixe","tag":["GOTO Conference","Chicago","Keynote","Innovation"],"thumbnails":{"default":{"url":"https://i.ytimg.com/vi/lzXHMy4ewtM/default.jpg","height":90,"width":120}},"title":"Idée Fixe"}}]}},"pageContext":{"slug":"chicago","tag":"Chicago"}}