{"data":{"talkJson":{"description":"Speaker(s):\nRob Dodson\n\nDescription:\nEntering the multi-screen era means rethinking how we build our applications. Producing a few PSDs doesn't cut it anymore, we have to start seeing the things we design as components within larger systems. Join us to learn how to use Polymer to revolutionize your design process. With these new tools we can create the UIs of the future, and shorten the time between concept and reality.\n\nWatch all Google I/O 2014 videos at: g.co/io14videos","meta":{"duration":"PT41M31S"},"presenter":{"name":null},"slug":"google-io-2014-unlock-the-next-era-of-ui-development-with-polymer","source":{"id":"HKrYfrAzqFA","provider":"youtube"},"tag":["Google","I/O","IO","io14","Develop","Polymer","product: web","fullname: Rob Dodson","Location: other","Team: Scalable Advocacy","Type: Live Event","GDS: Upload only","Other: NoGreenScreen"],"title":"Google I/O 2014 - Unlock the next era of UI development with Polymer"},"allTalkJson":{"edges":[{"node":{"description":"It's not a demo, more of a philosophical argument: Why did Sergey Brin and his team at Google want to build an eye-mounted camera/computer, codenamed Glass? Onstage at TED2013, Brin calls for a new way of seeing our relationship with our mobile computers -- not hunched over a screen but meeting the world heads-up.","meta":{"duration":"PT7M16S"},"presenter":{"name":"Sergey Brin"},"source":{"id":"IessjPY9gwI","provider":"youtube"},"slug":"why-google-glass","tag":["TEDTalks","Design","User Interface","Google"],"thumbnails":{"default":{"url":"https://i.ytimg.com/vi/IessjPY9gwI/default.jpg","height":90,"width":120}},"title":"Why Google Glass?"}},{"node":{"description":"Droidcon had its first Canadian edition on April 9-10, 2015 in Montreal. \nIt was organized by Mirego http://www.mirego.com/en \n\nWe had Jake Wharton telling us more about some Ok Libraries at Droidcon Montreal.\n\nA Few \"OK\" Libraries:\nThis talk will be an in-depth look at Okio—a tiny library for interacting with bytes—and a few of the libraries written on top of it: OkHttp, Retrofit, and a newcomer named Moshi. \n\nOkio evolved naturally inside of OkHttp before being split out into its own library. It wraps common patterns behind a friendly API for reading, writing, and processing data. We'll start with some fundamentals of the library and how it can enable you to work very close to raw data with ease. \n\nAfter an introduction to Okio, we will look at three libraries written with it: OkHttp, a modern HTTP client; Retrofit, a high-level HTTP wrapper; and Moshi, a brand new library for serialization. \n\nNot only are these libraries powerful on their own, but when combined their efficiency and performance dramatically increase. We'll conclude with demonstration of how to use them in your applications to great effect. \n\n- Jake Wharton\n\nAndroid developer for Square working on Square Cash. Has a long-time severe allergy to boilerplate code and for years has been raising awareness on the issue as well as leading efforts to eradicate this horrible disease that plagues modern developers.","meta":{"duration":"PT1H9M20S"},"presenter":{"name":null},"source":{"id":"WvyScM_S88c","provider":"youtube"},"slug":"droidcon-montreal-jake-wharton-a-few-ok-libraries","tag":["Droidcon","Montreal (City/Town/Village)","Library (Software Genre)","Programming Language","Canada","Droidcon Montreal","Google I/O (Conference Series)","Android (Operating System)","Conference","Android Programming","Developers","Google"],"thumbnails":{"default":{"url":"https://i.ytimg.com/vi/WvyScM_S88c/default.jpg","height":90,"width":120}},"title":"Droidcon Montreal Jake Wharton - A Few Ok Libraries"}},{"node":{"description":"The latest version of Polymer is fast and lean. Learn how teams at Google have successfully launched sites using Polymer and the latest platform APIs: Web Animations, Service Workers for offline and push notifications, and material design. And if you're new to Polymer we'll show you how to get started building mobile-first apps.","meta":{"duration":"PT46M28S"},"presenter":{"name":"Eric Bidelman, Matthew McNulty, Taylor Savage"},"source":{"id":"fD2As5RmM8Q","provider":"youtube"},"slug":"polymer-and-modern-web-apis-in-production-at-google-scale","tag":["Google I/O 2015","Polymer","Web components"],"thumbnails":{"default":{"url":"https://i.ytimg.com/vi/fD2As5RmM8Q/default.jpg","height":90,"width":120}},"title":"Polymer and modern web APIs: In production at Google scale"}}]}},"pageContext":{"slug":"google-io-2014-unlock-the-next-era-of-ui-development-with-polymer","tags":["Google","I/O","IO","io14","Develop","Polymer","product: web","fullname: Rob Dodson","Location: other","Team: Scalable Advocacy","Type: Live Event","GDS: Upload only","Other: NoGreenScreen"]}}