{"data":{"allTalkJson":{"edges":[{"node":{"description":"There are now several frameworks designed to address the demand for \"big agile.\"\n\nIn this talk Jez will explain the flaws in such frameworks, why they so often fail to produce the desired effects, and what we should do instead. He will also address some common organizational obstacles to moving fast at scale: governance, budgeting, and the project paradigm - and discuss how to address them. Warning: this talk will include liberal use of real, statistically sound data.","meta":{"duration":"PT51M2S"},"presenter":{"name":"Jez Humble"},"source":{"id":"2zYxWEZ0gYg","provider":"youtube"},"slug":"why-scaling-agile-doesnt-work","tag":["GOTO Conference","Agile","Scrum"],"thumbnails":{"default":{"url":"https://i.ytimg.com/vi/2zYxWEZ0gYg/default.jpg","height":90,"width":120}},"title":"Why Scaling Agile Doesn't Work"}},{"node":{"description":"This presentation was recorded at GOTO Copenhagen 2015\nhttp://gotocph.com\n\nErik Meijer - Founder at Applied Duality, Inc.\n\nABSTRACT\nErik challenges the basic ideas on Scrum & Agile and how developers should be developing code for the future. In the next decade every business will be digitized and effectively become a software company. Leveraging software, and, in general, computational [...]\nDownload slides and read the full abstract here:\nhttp://gotocon.com/cph-2015/presentation/Keynote:%20One%20Hacker%20Way\n\nhttps://twitter.com/gotocph\nhttps://www.facebook.com/GOTOConference\nhttp://gotocon.com","meta":{"duration":"PT55M37S"},"presenter":{"name":"Erik Meijer"},"source":{"id":"FvMuPtuvP5w","provider":"youtube"},"slug":"one-hacker-way","tag":["GOTO 2015","Keynote","Scrum","Agile"],"thumbnails":{"default":{"url":"https://i.ytimg.com/vi/FvMuPtuvP5w/default.jpg","height":90,"width":120}},"title":"One Hacker Way"}},{"node":{"description":"Many people have experienced using Agile approaches within teams to deliver more working software, but what can be learnt from combing these approaches with Product Development?\n\nThis talk will cover the top seven hard-earned tips I learnt from several years spent as a Senior Product Manger for BBC Worldwide. Ever wondered how you could influence the product you were building? How can you use Agile approaches to learn about what the right product to build is? How do you overcome defensiveness? How can you design experiments that challenge assumptions and encourage change?\n\nThis talk will provide some answers, combining ideas from organisational learning, psychology and negotiation.","meta":{"duration":"PT43M45S"},"presenter":{"name":"Benjamin Mitchell"},"source":{"id":"v7bNTqMlq-E","provider":"youtube"},"slug":"top-7-agile-tips-i-learnt-as-a-product-manager","tag":["GOTO Conference","Agile","Scrum"],"thumbnails":{"default":{"url":"https://i.ytimg.com/vi/v7bNTqMlq-E/default.jpg","height":90,"width":120}},"title":"Top 7 Agile Tips I learnt as a Product Manager"}}]}},"pageContext":{"slug":"scrum","tag":"Scrum"}}