{"description":"Subscribe to our youtube channel to be first receive updates on out new vidoes! \n\nMore info and slides here: http://www.hakkalabs.co/articles/core-async-a-clojure-library \n\nIn this talk, we hear from David Nolen from the New York Times about core.async, the new library for asynchronous programming in Clojure and ClojureScript. He'll be talking about Clojure, Communicating Sequential Processes & Responsive Design. This talk was recorded at the NY Clojure Users Group meetup at Two Sigma Investments.\n\nAs clients diversify on all fronts, how do we program flexible user interfaces without getting mired in software bloat and rampant complexity? Communicating Sequential Processes gives us the tools we need to design modular user interface components - we'll see how with Clojure, ClojureScript and core.async.\n\nBio: David Nolen is a JavaScript developer at The New York Times. He is the main developer of the Clojure Contrib library core.logic, a Prolog-like logic engine, and match, an optimizing pattern match compiler. He loves hacking at the intersection between object oriented, functional, and logic programming paradigms.\n\nHere is the WikiPedia link to learn more about Clojure:\nhttp://en.wikipedia.org/wiki/Clojure\n\nAnd here is the Clojure programming language home page:\nhttp://clojure.org/","id":"6f48b6fa-ab92-435a-9bd9-dab852ed7c4a","meta":{"duration":"PT55M32S"},"presenter":{"name":null},"slug":"clojure-clojure-library-coreasync-for-asynchronous-programming","source":{"id":"AhxcGGeh5ho","provider":"youtube"},"tag":["Core.async","Clojure library","clojure libraries","asynchronous programming","clojure"],"title":"Clojure: Clojure Library Core.async for Asynchronous Programming","thumbnails":{"default":{"url":"https://i.ytimg.com/vi/AhxcGGeh5ho/default.jpg","width":120,"height":90},"medium":{"url":"https://i.ytimg.com/vi/AhxcGGeh5ho/mqdefault.jpg","width":320,"height":180},"high":{"url":"https://i.ytimg.com/vi/AhxcGGeh5ho/hqdefault.jpg","width":480,"height":360}}}