{"description":"Genetic programming harnesses the mechanisms of natural evolution, including mutation, recombination, and natural selection, to automatically synthesize computer programs. It has been applied to a wide range of problems spanning several areas of science, engineering, and the arts, in many cases equaling or exceeding human performance.\n\nGenetic programming's roots are in Lisp, making Clojure a natural choice for modern genetic programming research and development. In this talk I will show how a simple genetic programming system can be written in about 100 lines of Clojure code, how a mature genetic programming system (PushGP) implemented in Clojure can improve the state of the art in automatic programming, and how genetic programming can be incorporated into an artificial life environment implemented in Clojure and Quil.\n\nAbout the speaker: Lee Spector is a Professor of Computer Science in the School of Cognitive Science at Hampshire College in Amherst, Massachusetts, and an adjunct professor of Computer Science at the University of Massachusetts, Amherst. His areas of teaching and research include genetic and evolutionary computation, quantum computation, and a variety of intersections between computer science, cognitive science, evolutionary biology, and the arts. He is the Editor-in-Chief of the journal Genetic Programming and Evolvable Machines (published by Springer) and a member of the editorial board of Evolutionary Computation (published by MIT Press). He is also a member of the SIGEVO executive committee and he was named a Fellow of the International Society for Genetic and Evolutionary Computation. \n\nMore details: http://hampshire.edu/lspector Resume: http://hampshire.edu/lspector/spector-resume.pdf","id":"2e6d57ef-294e-441a-8502-8909a69bdb77","meta":{"duration":"PT40M8S"},"presenter":{"name":null},"slug":"genetic-programming-in-clojure-lee-spector","source":{"id":"HWMJdO4klIE","provider":"youtube"},"tag":["clojure","Genetic Programming"],"title":"Genetic Programming in Clojure - Lee Spector","thumbnails":{"default":{"url":"https://i.ytimg.com/vi/HWMJdO4klIE/default.jpg","width":120,"height":90},"medium":{"url":"https://i.ytimg.com/vi/HWMJdO4klIE/mqdefault.jpg","width":320,"height":180},"high":{"url":"https://i.ytimg.com/vi/HWMJdO4klIE/hqdefault.jpg","width":480,"height":360}}}